---
kind: property
id: P:Autodesk.Revit.DB.TextNode.IsTransparent
source: html/4e205812-5126-dae5-5d0c-7643d04b630d.htm
---
# Autodesk.Revit.DB.TextNode.IsTransparent Property

Indicates whether the text background is transparent or opaque.

## Syntax (C#)
```csharp
public bool IsTransparent { get; }
```